UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_СопоставлениеСкладов/рар_мп_СопоставлениеСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рар_мп_СопоставлениеСкладов</name>
</mdclass:DataProcessor>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_СопоставленныеСклады/рар_мп_СопоставленныеСклады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_СопоставленныеСклады</name>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <attributes>
    <name>НазваниеСкладаНаМаркетплейсе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ЯМ_campaignId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_СопоставлениеСкладов/Forms/Форма/Module.bsl
#Область СлужебныеПроцедурыИФункцииДляПроверкиПЛС

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПриПовторномОткрытииНаСервере()
	Возврат Константы.рар_мп_Согласие.Получить();
КонецФункции

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АккаунтМаркетплейсаПриИзмененииНаСервере()
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
	
		Элементы.СопоставленныеСклады.ПодчиненныеЭлементы.СопоставленныеСкладыCampaignId.Видимость = Истина;
		
		Элементы.СопоставлениеСкладов.ПодчиненныеЭлементы.СопоставлениеСкладовCampaignId.Видимость = Истина;
	
	Иначе
	
		Элементы.СопоставленныеСклады.ПодчиненныеЭлементы.СопоставленныеСкладыCampaignId.Видимость = Ложь;
		
		Элементы.СопоставлениеСкладов.ПодчиненныеЭлементы.СопоставлениеСкладовCampaignId.Видимость = Ложь;
	
	КонецЕсли;
	
	СопоставленныеСклады.Очистить();
	
	СопоставлениеСкладов.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура АккаунтМаркетплейсаПриИзменении(Элемент)
	АккаунтМаркетплейсаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеСкладовСкладПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СопоставлениеСкладов.ТекущиеДанные;
	
	ТекущаяСтрока.ВыборСтроки = Истина;
		
КонецПроцедуры

#КонецОбласти

#Область КнопкиУстановкиИСнятияГалочек

&НаКлиенте
Процедура ВыбратьВсеСтроки(Команда)
	
	Если Элементы.СтраницыСопоставлениеИСопоставленныеСклады.ТекущаяСтраница.Имя = "СтраницаСопоставлениеСкладов" Тогда
	
		Для каждого Стр Из СопоставлениеСкладов Цикл
		
			Стр.ВыборСтроки = Истина;	
		
		КонецЦикла;	
	
	Иначе
	
		Для каждого Стр Из СопоставленныеСклады Цикл
		
			Стр.ВыборСтроки = Истина;	
		
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеВсехСтрок(Команда)
	
	Если Элементы.СтраницыСопоставлениеИСопоставленныеСклады.ТекущаяСтраница.Имя = "СтраницаСопоставлениеСкладов" Тогда
	
		Для каждого Стр Из СопоставлениеСкладов Цикл
		
			Стр.ВыборСтроки = Ложь;	
		
		КонецЦикла;	
	
	Иначе
	
		Для каждого Стр Из СопоставленныеСклады Цикл
		
			Стр.ВыборСтроки = Ложь;	
		
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаСпискаСкладов

&НаКлиенте
Процедура ЗагрузитьДанныеИзМаркетплейса(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		СопоставлениеСкладов.Очистить();
		
		ДлительнаяОперация     = ПолучитьСкладыМаркетплейсов();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Получение списка складов ...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеЗагрузкиСкладов", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания); 
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладыМаркетплейсов()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Ozon Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
			"рар_мп_СопоставлениеСкладов.ПолучитьСписокСкладов_Ozon", АккаунтМаркетплейса);
			
		Возврат ВозвратныеДанные;

		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
			"рар_мп_СопоставлениеСкладов.ПолучитьСписокСкладов_ЯндексМаркет", АккаунтМаркетплейса);
			
		Возврат ВозвратныеДанные;
			
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда 
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
		
    	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
        	"рар_мп_СопоставлениеСкладов.ПолучитьСписокСкладов_Wildberries",АккаунтМаркетплейса);
	
				
		 Возврат ВозвратныеДанные;
		
	КонецЕсли;   
	
КонецФункции

&НаСервере
Процедура ЗавершениеЗагрузкиСкладовНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
	
		СопоставлениеСкладов.Загрузить(ТЗ);
		
		
		Если СопоставлениеСкладов.Количество() = 0 Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Для данного аккаунта нет складов для сопоставления");
			
		Иначе
			
			ОбщегоНазначения.СообщитьПользователю("Загрузка складов завершена");
		
		КонецЕсли;
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при загрузке складов из маркетплейса. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при загрузке складов из маркетплейса в табличную часть", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЗагрузкиСкладов(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеЗагрузкиСкладовНаСервере(Результат);	
	
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область СохранениеСопоставления

&НаСервере
Функция СохранитьСопоставлениеНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"рар_мп_СопоставлениеСкладов.СохранениеСопоставления", СопоставлениеСкладов.Выгрузить(), АккаунтМаркетплейса);
		
	Возврат ВозвратныеДанные;	
	
КонецФункции 

&НаКлиенте
Процедура СохранитьСопоставление(Команда)

	Если ПроверитьЗаполнение() Тогда
		
		ДлительнаяОперация     = СохранитьСопоставлениеНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Сохранение сопоставления ...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеСопоставления", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСопоставления(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеСопоставленияНаСервере(Результат);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеСопоставленияНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
	
		СопоставлениеСкладов.Загрузить(ТЗ);
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при удалении сопоставленных складов из табличной части. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при удалении сопоставленных складов из табличной части", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;
	
	
КонецПроцедуры

#КонецОбласти 

#Область ЗагрузкаСопоставленныхСкладов

&НаКлиенте
Процедура ЗагрузитьСопоставленныеСклады(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		ЗагрузитьСопоставленныеСкладыНаСервере();	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСопоставленныеСкладыНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_СопоставленныеСклады.УникальныйИдентификаторСклада КАК УникальныйИдентификаторСклада,
		|	рар_мп_СопоставленныеСклады.Склад КАК Склад,
		|	рар_мп_СопоставленныеСклады.рар_мп_ЯМ_campaignId КАК CampaignId,
		|	рар_мп_СопоставленныеСклады.НазваниеСкладаНаМаркетплейсе КАК НазваниеСклада
		|ИЗ
		|	РегистрСведений.рар_мп_СопоставленныеСклады КАК рар_мп_СопоставленныеСклады
		|ГДЕ
		|	рар_мп_СопоставленныеСклады.АккаунтМаркетплейса = &АккаунтМаркетплейса";
	
	Запрос.УстановитьПараметр("АккаунтМаркетплейса", АккаунтМаркетплейса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Попытка
	
		СопоставленныеСклады.Загрузить(ВыборкаДетальныеЗаписи);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка сопоставленных складов завершена";
		Сообщение.Сообщить();
	
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при загрузке сопоставленных складов. Подробную ошибку можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Ошибка при загрузке сопоставленных складов",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
	
	КонецПопытки;

	
КонецПроцедуры

#КонецОбласти 

#Область УдалениеСопоставленияСкладов

&НаКлиенте
Процедура УдалитьСопоставлениеСкладов(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		ДлительнаяОперация     = УдалитьСопоставлениеСкладовНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Удаление сопоставления ...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеУдаленияСопоставления", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
	
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервере
Функция УдалитьСопоставлениеСкладовНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"рар_мп_СопоставлениеСкладов.УдалениеСопоставления", СопоставленныеСклады.Выгрузить(), АккаунтМаркетплейса);
		
	Возврат ВозвратныеДанные;		
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеУдаленияСопоставления(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеУдаленияСопоставленияНаСервере(Результат);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеУдаленияСопоставленияНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
	
		СопоставленныеСклады.Загрузить(ТЗ);
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при удалении сопоставленных складов из табличной части. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при удалении сопоставленных складов из табличной части", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;
	
	
КонецПроцедуры

#КонецОбласти
